SectionnerClient/Sectionner.SaveUserLog.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns="Sectionner">
 <SOAP-ENV:Body>
  <!-- ns__SaveUserLog(..., ns__User requestUserInfo, ns__UserLog requestActivityLogInfo, ...) -->
  <ns:SaveUserLog>
   <!-- ns__User requestUserInfo -->
   <requestUserInfo>
    <!-- int userId -->
    <userId>0</userId>
    <!-- std::string userName -->
    <userName></userName>
    <!-- std::string userPassword -->
    <userPassword></userPassword>
    <!-- std::string userNewPassword -->
    <userNewPassword></userNewPassword>
    <!-- std::string userFirstName -->
    <userFirstName></userFirstName>
    <!-- std::string userLastName -->
    <userLastName></userLastName>
    <!-- enum ns__UserType userType -->
    <userType>Monitor</userType>
    <!-- std::string userKey -->
    <userKey></userKey>
    <!-- time_t userSubmit -->
    <userSubmit>2016-05-24T06:19:17Z</userSubmit>
    <!-- ns__ErrorCode userError -->
    <userError>
     <!-- int errorNumber -->
     <errorNumber>0</errorNumber>
     <!-- std::string errorMessage -->
     <errorMessage></errorMessage>
     <!-- enum ns__SettingLevel errorType -->
     <errorType>Normal</errorType>
    </userError>
   </requestUserInfo>
   <!-- ns__UserLog requestActivityLogInfo -->
   <requestActivityLogInfo>
    <!-- ns__ReportRange userLogStartEndDateTime -->
    <userLogStartEndDateTime>
     <!-- time_t reportStartDate -->
     <reportStartDate>2016-05-24T06:19:17Z</reportStartDate>
     <!-- time_t reportEndDate -->
     <reportEndDate>2016-05-24T06:19:17Z</reportEndDate>
    </userLogStartEndDateTime>
    <!-- std::string userLogData -->
    <userLogData></userLogData>
    <!-- ns__User userLogUser -->
    <userLogUser>
     <!-- int userId -->
     <userId>0</userId>
     <!-- std::string userName -->
     <userName></userName>
     <!-- std::string userPassword -->
     <userPassword></userPassword>
     <!-- std::string userNewPassword -->
     <userNewPassword></userNewPassword>
     <!-- std::string userFirstName -->
     <userFirstName></userFirstName>
     <!-- std::string userLastName -->
     <userLastName></userLastName>
     <!-- enum ns__UserType userType -->
     <userType>Monitor</userType>
     <!-- std::string userKey -->
     <userKey></userKey>
     <!-- time_t userSubmit -->
     <userSubmit>2016-05-24T06:19:17Z</userSubmit>
     <!-- ns__ErrorCode userError -->
     <userError>
      <!-- int errorNumber -->
      <errorNumber>0</errorNumber>
      <!-- std::string errorMessage -->
      <errorMessage></errorMessage>
      <!-- enum ns__SettingLevel errorType -->
      <errorType>Normal</errorType>
     </userError>
    </userLogUser>
    <!-- ns__ErrorCode userLogError -->
    <userLogError>
     <!-- int errorNumber -->
     <errorNumber>0</errorNumber>
     <!-- std::string errorMessage -->
     <errorMessage></errorMessage>
     <!-- enum ns__SettingLevel errorType -->
     <errorType>Normal</errorType>
    </userLogError>
   </requestActivityLogInfo>
  </ns:SaveUserLog>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
